realmcu/Wearable/display/coda_J10/ram_proj_240619_v4/ram_proj/src/sd_mgr/sd_lib/rtl876x_sdio.c
/**
*********************************************************************************************************
*               Copyright(c) 2016, Realtek Semiconductor Corporation. All rights reserved.
**********************************************************************************************************
* @file       rtl876x_sdio.c
* @brief     This file provides all the SDIO firmware functions.
* @details
* @author   elliot chen
* @date      2017-01-03
* @version  v1.0
*********************************************************************************************************
*/

/* Includes -----------------------------------------------------------------*/
#include "rtl876x_rcc.h"
#include "rtl876x_sdio.h"

/* Internal defines -----------------------------------------------------------*/
#define SDIO_REG_TEST_MODE          *((volatile uint32_t *)0x400002B4UL)
#define SDIO_REG_PULL_MODE          *((volatile uint32_t *)0x400002ACUL)

/**
  * @brief  Select the SDIO output pin group.
  * @param  SDIO_PinGroupType:
    This parameter can be one of the following values:
  *  @arg SDIO_PinGroup_0
  *  @arg SDIO_PinGroup_1
  * @retval None
  */
void SDIO_PinGroupConfig(uint32_t SDIO_PinGroupType)
{
    /* Check the parameters */
    assert_param(IS_SDIO_PINGROUP_IDX(SDIO_PinGroupType));

    if (SDIO_PinGroupType == SDIO_PinGroup_0)
    {
        SDIO_REG_PULL_MODE |= 0x0F << 20;
    }

    /* Dedicated SDIO pin option */
    SDIO_REG_TEST_MODE &= ~(BIT(1));
    SDIO_REG_TEST_MODE |= SDIO_PinGroupType << 1;
}

/**
  * @brief  Select the SDIO data bus pin.
  * @param  SDIO_BusWide:
    This parameter can be one of the following values:
  *  @arg SDIO_BusWide_1b
  *  @arg SDIO_BusWide_4b
  * @param  NewState: new state of the SDIO data pin.
    This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO_DataPinConfig(uint32_t SDIO_BusWide, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_SDIO_BUS_WIDE(SDIO_BusWide));

    if (NewState != DISABLE)
    {
        if (SDIO_BusWide == SDIO_BusWide_1b)
        {
            SDIO_REG_TEST_MODE |= 0b00000111 << 4;
        }
        else
        {
            SDIO_REG_TEST_MODE |= 0x00000FF0;
        }
    }
    else
    {
        SDIO_REG_TEST_MODE &= ~(0x00000FF0);
    }
}

/**
  * @brief  Enables or disables the SDIO output pin.
  * @param  NewState: new state of the SDIO output pin.
    This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO_PinOutputCmd(FunctionalState NewState)
{
    if (NewState != DISABLE)
    {
        /* Enable SDIO pin output */
        SDIO_REG_TEST_MODE |= BIT(0);
    }
    else
    {
        /* Disable SDIO pin output */
        SDIO_REG_TEST_MODE &= ~(BIT(0));
    }
}

/**
 * @brief  Software reset host controller.
 * @clock  none.
 * @return none.
 */
void SDIO_SoftwareReset(void)
{
    /* Software reset for all */
    SDIO->SW_RESET |= SDIO_SF_RESET_MASK;
}

/**
 * @brief  Get Software reset status.
 * @clock  none.
 * @return Software reset status: SET: reset in progress, RESET: can work.
 */
FlagStatus SDIO_GetSoftwareResetStatus(void)
{
    FlagStatus bitstatus = RESET;

    if ((SDIO->SW_RESET & SDIO_SF_RESET_MASK) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return bitstatus;
}

/**
  * @brief  Enables or disables the SDIO internal Clock.
  * @param  NewState: new state of the SDIO internal Clock.
    This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO_InternalClockCmd(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE)
    {
        /* Enable internal clock */
        SDIO->CLK_CTRL |= SDIO_INTERNAL_CLOCK_MASK;
    }
    else
    {
        /* Disable internal clock */
        SDIO->CLK_CTRL &= SDIO_INTERNAL_CLOCK_CLR;
    }
}

/**
 * @brief  Get internal clock stable or not.
 * @clock  none.
 * @return Software reset status: SET: ready, RESET: not ready.
 */
FlagStatus SDIO_GetInternalClockStatus(void)
{
    FlagStatus bitstatus = RESET;

    if ((SDIO->CLK_CTRL & SDIO_INTERNAL_CLK_STABLE_MASK) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return bitstatus;
}

/**
  * @brief Initializes the SDIO peripheral according to the specified
  *   parameters in the SDIO_InitStruct.
  * @param  SDIO_InitStruct: pointer to a SDIO_InitTypeDef structure that
  *   contains the configuration information for the specified SDIO peripheral.
  * @retval None
  */
void SDIO_Init(SDIO_InitTypeDef *SDIO_InitStruct)
{
    /* Enable SDIO host card detect circuit */
    //*((volatile uint32_t *)0x4005d000) |= BIT(10);

    /* Select 32-bit ADMA2 */
    if (SDIO->CAPABILITIES_L & BIT(19))
    {
        SDIO->HOST_CTRL &= ~(0x03 << 3);
        SDIO->HOST_CTRL |= 0x02 << 3;
    }

    /*Configure SDCLK frequency */
    SDIO->CLK_CTRL &= ~(BIT(2));
    //SDIO->CLK_CTRL &= 0xff;
    SDIO->CLK_CTRL &= ~(0xFF00);
    SDIO->CLK_CTRL |= SDIO_InitStruct->SDIO_ClockDiv;
    SDIO->CLK_CTRL |= BIT(2);

    /* Configure SDIO bus width */
    SDIO->HOST_CTRL &=  ~(BIT(1));
    SDIO->HOST_CTRL |=  SDIO_InitStruct->SDIO_BusWide;

    /* Configure DAT line timeouts */
    SDIO->TIMEOUT_CTRL = SDIO_InitStruct->SDIO_TimeOut;
}

/**
  * @brief  Fills each SDIO_InitStruct member with its default value.
  * @param  SDIO_InitStruct: pointer to an SDIO_InitTypeDef structure which will be initialized.
  * @retval None
  */
void SDIO_StructInit(SDIO_InitTypeDef *SDIO_InitStruct)
{
    /* time out = TMCLK * 2^(SDIO_TimeOut+13). 0<= SDIO_TimeOut <= 0x0E. TMCLK: the base clock. */
    SDIO_InitStruct->SDIO_TimeOut = 0x0E;
    SDIO_InitStruct->SDIO_BusWide = SDIO_BusWide_1b;
    SDIO_InitStruct->SDIO_ClockDiv = SDIO_CLOCK_DIV_256;
}

/**
  * @brief  Sets the SD bus power status of the controller.
  * @param  SDIO_PowerState: new state of the Power state.
  *   This parameter can be one of the following values:
  *   - SDIO_PowerState_OFF
  *   - SDIO_PowerState_ON
  * @retval None
  */
void SDIO_SetBusPower(uint32_t SDIO_PowerState)
{
    /* Check the parameters */
    assert_param(IS_SDIO_POWER_STATE(SDIO_PowerState));

    /* SD bus power off */
    SDIO->PWR_CTRL &= ~(BIT(0));
    SDIO->PWR_CTRL = SDIO_VOLT_3_3V;
    /* SD bus power on */
    SDIO->PWR_CTRL |= SDIO_PowerState;
}

/**
  * @brief  Initializes the SDIO data path according to the specified
*      parameters in the SDIO_DataInitStruct.
  * @param  SDIO_DataInitStruct : pointer to a SDIO_DataInitTypeDef
  *   structure that contains the configuration information for the SDIO command.
  * @retval None
  */
void SDIO_DataConfig(SDIO_DataInitTypeDef *SDIO_DataInitStruct)
{
    /* Check the parameters */
    assert_param(IS_SDIO_BLOCK_COUNT(SDIO_DataInitStruct->SDIO_BlockCount));
    assert_param(IS_SDIO_BLOCK_SIZE(SDIO_DataInitStruct->SDIO_BlockSize));
    assert_param(IS_SDIO_TRANSFER_DIR(SDIO_DataInitStruct->SDIO_TransferDir));

    if (SDIO_DataInitStruct->SDIO_DMAEn == ENABLE)
    {
        /* Set start address of the descriptor table */
        SDIO->ADMA_SYS_ADDR_L = SDIO_DataInitStruct->SDIO_Address;
    }

