realmcu/Wearable/display/coda_J10/ram_proj_240619_v4/ram_proj/src/sd_mgr/sd_lib/rtl876x_sdio.c
    /* Set block size */
    SDIO->BLK_SIZE = SDIO_DataInitStruct->SDIO_BlockSize;
    /* Set block count */
    SDIO->BLK_CNT = SDIO_DataInitStruct->SDIO_BlockCount;

    if (SDIO_DataInitStruct->SDIO_BlockCount == 1)
    {
        /* Single block */
        SDIO->TF_MODE = SDIO_DataInitStruct->SDIO_TransferDir | \
                        SDIO_DataInitStruct->SDIO_DMAEn;
    }
    else
    {
        /* Multiple block */
        SDIO->TF_MODE = SDIO_MULTI_BLOCK_EN | \
                        SDIO_DataInitStruct->SDIO_TransferDir | \
                        SDIO_AUTO_CMD12_EN |  SDIO_BLOCK_COUNT_EN | \
                        SDIO_DataInitStruct->SDIO_DMAEn;
    }
}

/**
  * @brief  Fills each SDIO_DataInitStruct member with its default value.
  * @param  SDIO_DataInitStruct: pointer to an SDIO_DataInitTypeDef structure which
  *         will be initialized.
  * @retval None
*/
void SDIO_DataStructInit(SDIO_DataInitTypeDef *SDIO_DataInitStruct)
{
    /* SDIO_DataInitStruct members default value */
    SDIO_DataInitStruct->SDIO_Address       = 0;
    SDIO_DataInitStruct->SDIO_BlockCount    = 0x00;
    SDIO_DataInitStruct->SDIO_BlockSize     = 0x00;
    SDIO_DataInitStruct->SDIO_TransferDir   = SDIO_TransferDir_WRITE;
    SDIO_DataInitStruct->SDIO_DMAEn         = ENABLE;
}

/**
 * @brief  Configure SD clock.
 * @param SDIO_ClockDiv: value of SDIO clock divider.
 * @return none.
 */
void SDIO_SetClock(uint32_t clock_div)
{
    /* Check the parameters */
    assert_param(IS_SDIO_CLOCK_DIV(clock_div));

    /* Disable SDIO clock */
    SDIO->CLK_CTRL &= ~(BIT(2));
    /* Configure SDIO clock divider */
    SDIO->CLK_CTRL &= ~(0xFF00);
    SDIO->CLK_CTRL |= clock_div;
    /* Enable SDIO clock */
    SDIO->CLK_CTRL |= BIT(2);
}

/**
 * @brief  Configure SDIO clock.
 * @param SDIO_BusWide: value of SDIO bus wide.
 *   This parameter can be the following values:
 *   @arg SDIO_BusWide_1b: 1-bit mode.
 *   @arg SDIO_BusWide_4b: 4-bit mode.
 * @return none.
 */
void SDIO_SetBusWide(uint32_t SDIO_BusWide)
{
    /* Check the parameters */
    assert_param(IS_SDIO_BUS_WIDE(SDIO_BusWide));

    SDIO->HOST_CTRL &= ~(BIT(1));
    SDIO->HOST_CTRL |= SDIO_BusWide;
}

/**
 * @brief  Set start address of the descriptor table.
 * @address: start address of the descriptor table.
 * @return none.
 */
void SDIO_SetSystemAddress(uint32_t address)
{
    SDIO->ADMA_SYS_ADDR_L = address;
}

/**
 * @brief  Set block size.
 * @BlockSize:  block size.
 * @return none.
 */
void SDIO_SetBlockSize(uint32_t BlockSize)
{
    SDIO->BLK_SIZE = BlockSize;
}

/**
 * @brief  Set block count.
 * @BlockCount:  block count.
 * @return none.
 */
void SDIO_SetBlockCount(uint32_t BlockCount)
{
    SDIO->BLK_CNT = BlockCount;
}

/**
  * @brief  Initializes the SDIO Command according to the specified
  *         parameters in the SDIO_CmdInitStruct and send the command.
  * @param  SDIO_CmdInitStruct : pointer to a SDIO_CmdInitTypeDef
  *         structure that contains the configuration information for the SDIO command.
  * @retval None
  */
void SDIO_SendCommand(SDIO_CmdInitTypeDef *SDIO_CmdInitStruct)
{
    /* Check the parameters */
    assert_param(IS_SDIO_CMD_INDEX(SDIO_CmdInitStruct->SDIO_CmdIndex));

    /* Set the SDIO Argument value */
    SDIO->ARG = SDIO_CmdInitStruct->SDIO_Argument;
    /* SDIO CMD Configuration */
    SDIO->CMD = (SDIO_CmdInitStruct->SDIO_CmdIndex << 8)     | \
                (SDIO_CmdInitStruct->SDIO_CmdType << 6)      | \
                (SDIO_CmdInitStruct->SDIO_DataPresent << 5)  | \
                (SDIO_CmdInitStruct->SDIO_CmdIdxCheck << 4)  | \
                (SDIO_CmdInitStruct->SDIO_CmdCrcCheck << 3)  | \
                (SDIO_CmdInitStruct->SDIO_ResponseType);
}

/**
  * @brief  Fills each SDIO_CmdInitStruct member with its default value.
  * @param  SDIO_CmdInitStruct: pointer to an SDIO_CmdInitTypeDef structure which
  *         will be initialized.
  * @retval None
*/
void SDIO_CmdStructInit(SDIO_CmdInitTypeDef *SDIO_CmdInitStruct)
{
    /* SDIO_CmdInitStruct members default value */
    SDIO_CmdInitStruct->SDIO_Argument       = 0;
    SDIO_CmdInitStruct->SDIO_CmdIndex       = 0;
    SDIO_CmdInitStruct->SDIO_CmdType        = NORMAL;
    SDIO_CmdInitStruct->SDIO_DataPresent    = NO_DATA;
    SDIO_CmdInitStruct->SDIO_CmdIdxCheck    = 0;
    SDIO_CmdInitStruct->SDIO_CmdCrcCheck    = 0;
    SDIO_CmdInitStruct->SDIO_ResponseType   = SDIO_Response_No;
}

/**
  * @brief  Read data through the SDIO peripheral.
  * @param  None.
  * @retval  The value of the received data.
  */
uint32_t SDIO_ReadData(void)
{
    return SDIO->BUF_DATA_PORT;
}

/**
  * @brief  Write data through the SDIO peripheral.
  * @param  Data: Data to be transmitted.
  * @retval  none.
  */
void SDIO_WriteData(uint32_t Data)
{
    SDIO->BUF_DATA_PORT = Data;
}

/**
  * @brief  Enables or disables the specified SDIO interrupt status.
  * @param  SDIO_INTStatus: specifies the IR interrupt status to be enabled or disabled.
  *   This parameter can be the following values:
  *      @arg SDIO_INT_CARD: card interrupt status.
  *      @arg SDIO_INT_DMA: DMA interrupt status.
  *      @arg SDIO_INT_TF_CMPL: transfer complete interrupt status.
  *      @arg SDIO_INT_CMD_CMPL: command complete interrupt status.
  * @param  NewState: new state of the specified SDIO interrupt status.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO_INTStatusConfig(uint32_t SDIO_INTStatus, FunctionalState newState)
{
    /* Check the parameters */
    assert_param(IS_SDIO_INT(SDIO_INTStatus));
    assert_param(IS_FUNCTIONAL_STATE(newState));

    if (newState == ENABLE)
    {
        /* Enable the selected SDIO interrupt status */
        SDIO->NORMAL_INTR_SR_EN |= SDIO_INTStatus;
    }
    else
    {
        /* Disable the selected SDIO interrupt status */
        SDIO->NORMAL_INTR_SR_EN &= ~SDIO_INTStatus;
    }
}

/**
  * @brief  Enables or disables the specified SDIO interrupts.
  * @param  SDIO_INT: specifies the IR interrupts sources to be enabled or disabled.
  *   This parameter can be the following values:
  *      @arg SDIO_INT_ERROR: Error interrupt signal caused by any type error in error interrupt status register
  *    which can trigger interrupt to NVIC.
  *      @arg SDIO_INT_CARD: card interrupt signal which can trigger interrupt to NVIC.
  *      @arg SDIO_INT_DMA: DMA interrupt signal which can trigger interrupt to NVIC.
  *      @arg SDIO_INT_TF_CMPL: transfer interrupt interrupt signal which can trigger interrupt to NVIC.
  *      @arg SDIO_INT_CMD_CMPL: command complete signal interrupt which can trigger interrupt to NVIC.
  * @param  NewState: new state of the specified SDIO interrupts.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO_INTConfig(uint32_t SDIO_INT, FunctionalState newState)
{
    /* Check the parameters */
    assert_param(IS_SDIO_INT(SDIO_INT));
    assert_param(IS_FUNCTIONAL_STATE(newState));

    if (newState == ENABLE)
    {
        /* Enable the selected SDIO interrupt */
        SDIO->NORMAL_INTR_SIG_EN |= SDIO_INT;
    }
    else
    {
        /* Disable the selected SDIO interrupt */
        SDIO->NORMAL_INTR_SIG_EN &= ~SDIO_INT;
    }
}

/**
  * @brief  Enables or disables the specified SDIO error interrupt status.
  * @param  SDIO_INTStatus: specifies the SDIO error interrupts status to be enabled or disabled.
  *   This parameter can be the following values:
  *    @arg  SDIO_INT_VENDOR_SPECIFIC_ERR:
  *    @arg  SDIO_INT_ADMA_ERR: Set when the host controller detects errors during ADMA based data transfer.
  *    @arg  SDIO_INT_AUTO_CMD12_ERR: Set when detecting that one of this bits D00-D04 in Auto CMD12 Error Status register
  *    has changed from 0 to 1.
  *      @arg SDIO_INT_CURRENT_LIMIT_ERR:
  *      @arg SDIO_INT_DAT_END_BIT_ERR: Set when detecting 0 at the end bit position of read data which uses the DAT line or at
  *    the end bit position of the CRC Status.
  *      @arg SDIO_INT_DAT_CRC_ERR:
  *      @arg SDIO_INT_DAT_TIMEOUT_ERR:
  *      @arg SDIO_INT_CMD_INDEX_ERR:
  *      @arg SDIO_INT_CMD_END_BIT_ERR:
  *      @arg SDIO_INT_CMD_CRC_ERR:
  *      @arg SDIO_INT_CMD_TIMEOUT_ERR:
  * @param  NewState: new state of the specified SDIO error interrupt status.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO_ErrrorINTStatusConfig(uint32_t SDIO_INTStatus, FunctionalState newState)
{
    /* Check the parameters */
    assert_param(IS_SDIO_ERR_INT(SDIO_INTStatus));
    assert_param(IS_FUNCTIONAL_STATE(newState));

    if (newState == ENABLE)
    {
        /* Enable the selected SDIO error interrupt status */
        SDIO->ERR_INTR_SR_EN |= SDIO_INTStatus;
    }
    else
    {
        /* Disable the selected SDIO error interrupt status */
        SDIO->ERR_INTR_SR_EN &= ~SDIO_INTStatus;
    }
}

/**
  * @brief  Enables or disables the specified SDIO error interrupts.
  * @param  SDIO_INT: specifies the SDIO error interrupts sources to be enabled or disabled.
  *   This parameter can be the following values:
  *    @arg  SDIO_INT_VENDOR_SPECIFIC_ERR:
  *    @arg  SDIO_INT_ADMA_ERR:
  *    @arg  SDIO_INT_AUTO_CMD12_ERR:
  *      @arg SDIO_INT_CURRENT_LIMIT_ERR:
  *      @arg SDIO_INT_DAT_END_BIT_ERR:
  *      @arg SDIO_INT_DAT_CRC_ERR:
  *      @arg SDIO_INT_DAT_TIMEOUT_ERR:
  *      @arg SDIO_INT_CMD_INDEX_ERR:
  *      @arg SDIO_INT_CMD_END_BIT_ERR:
  *      @arg SDIO_INT_CMD_CRC_ERR:
  *      @arg SDIO_INT_CMD_TIMEOUT_ERR:
  * @param  NewState: new state of the specified SDIO error interrupts.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO_ErrrorINTConfig(uint32_t SDIO_INT, FunctionalState newState)
{
    /* Check the parameters */
    assert_param(IS_SDIO_ERR_INT(SDIO_INT));
    assert_param(IS_FUNCTIONAL_STATE(newState));

    if (newState == ENABLE)
    {
        /* Enable the selected SDIO interrupt */
        SDIO->ERR_INTR_SIG_EN |= SDIO_INT;
    }
    else
    {
        /* Disable the selected SDIO error interrupt */
        SDIO->ERR_INTR_SIG_EN &= ~SDIO_INT;
    }
}

/**
  * @brief  Enables or disables the specified SDIO wake up event.
  * @param  SDIO_WakeUp: specifies the SDIO wake up sources to be enabled or disabled.
  *   This parameter can be the following values:
  *      @arg SDIO_WAKE_UP_SDCARD_REMOVAL:
  *      @arg SDIO_WAKE_UP_SDCARD_INSERT:
  *      @arg SDIO_WAKE_UP_SDCARD_INTR:
  * @param  NewState: new state of the specified SDIO wake up event.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO_WakeUpConfig(uint32_t SDIO_WakeUp, FunctionalState newState)
{
    /* Check the parameters */
    assert_param(IS_SDIO_WAKE_UP(SDIO_WakeUp));
    assert_param(IS_FUNCTIONAL_STATE(newState));

    if (newState == ENABLE)
    {
        /* Enable the selected SDIO wake up event */
        SDIO->WAKEUP_CTRL |= SDIO_WakeUp;
    }
    else
    {
        /* Disable the selected SDIO wake up event */
        SDIO->WAKEUP_CTRL &= ~SDIO_WakeUp;
    }
}

/**
 * @brief  Checks whether the specified SDIO interrupt is set or not.
 * @param  SDIO_FLAG: specifies the interrupt to check.
 *   This parameter can be one of the following values:
 *       @arg SDIO_INT_ERROR: Set when any of bits in the Error interrupt status register are set.
 *       @arg SDIO_INT_CARD: Set when generate card interrupt.
 *       @arg SDIO_INT_DMA: In case of ADMA, by setting int field in the descriptor table, host controller generates this interrupt.
 *       @arg SDIO_BLOCK_GAP_EVENT: Set when stop at Block Gap Request is set.
 *       @arg SDIO_INT_TF_CMPL: Set when a read/write transfer and a command with busy is complete.
 *     @arg SDIO_INT_CMD_CMPL: Set when get the end bit of command response(Except Auto CMD12).
 * @retval The new state of ITStatus (SET or RESET).
 */
ITStatus SDIO_GetINTStatus(uint32_t SDIO_INT)
{
    FlagStatus bitstatus = RESET;

    /* Check the parameters */
    assert_param(IS_SDIO_INT(SDIO_INT));

