realmcu/Wearable/display/coda_J10/ram_proj_240619_v4/ram_proj/src/sd_mgr/sd_lib/rtl876x_sdio.c
    if ((SDIO->NORMAL_INTR_SR & SDIO_INT) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return bitstatus;
}

/**
 * @brief  Checks whether the specified SDIO error interrupt is set or not.
 * @param  SDIO_INT: specifies the error interrupt to check.
 *   This parameter can be one of the following values:
 *     @arg SDIO_INT_VENDOR_SPECIFIC_ERR:
 *     @arg SDIO_INT_ADMA_ERR:
 *     @arg SDIO_INT_AUTO_CMD12_ERR:
 *   @arg SDIO_INT_CURRENT_LIMIT_ERR:
 *   @arg SDIO_INT_DAT_END_BIT_ERR:
 *   @arg SDIO_INT_DAT_CRC_ERR:
 *   @arg SDIO_INT_DAT_TIMEOUT_ERR:
 *   @arg SDIO_INT_CMD_INDEX_ERR:
 *   @arg SDIO_INT_CMD_END_BIT_ERR:
 *   @arg SDIO_INT_CMD_CRC_ERR:
 *   @arg SDIO_INT_CMD_TIMEOUT_ERR:
 * @retval The new state of ITStatus (SET or RESET).
 */
ITStatus SDIO_GetErrorINTStatus(uint32_t SDIO_INT)
{
    FlagStatus bitstatus = RESET;

    /* Check the parameters */
    assert_param(IS_SDIO_INT(SDIO_INT));

    if ((SDIO->ERR_INTR_SR & SDIO_INT) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return bitstatus;
}

/**
 * @brief  Checks whether the specified SDIO flag is set or not.
 * @param  SDIO_FLAG: specifies the flag to check.
 *   This parameter can be one of the following values:
 *       @arg : SDIO_FLAG_BUF_READ_EN:This status is used for non-DMA read transfer.
 *      -SET: Have data in buffer when block data is ready in the buffer.
 *      -RESET:  No Data.
 *     Supplement: A change of this bit from 0 to 1 occurs when block data is ready
 *      in the buffer and generates the Buffer Read Interrupt.
 *       @arg : SDIO_FLAG_WRITE_BUF_EN:This status is used for non-DMA write transfer.
 *      -SET: can write in non-DMA write transfers.
 *      -RESET:  can not write in non-DMA write transfers.
 *     Supplement: A change of this bit from 0 to 1 occurs when top of block data can be written to the buffer
 *      and generates the Buffer Write Ready Interrupt.
 *       @arg : SDIO_FLAG_READ_TF_ACTIVE:
 *      -SET: Transferring data in a read transfer.
 *      -RESET:  No valid data in a read transfer.
 *       @arg : SDIO_FLAG_WRITE_TF_ACTIVE:
 *      -SET: Transferring data in a write transfer.
 *      -RESET:  No valid data in a write transfer.
 *       @arg : SDIO_FLAG_DAT_LINE_ACTIVE:
 *      -SET: DAT line active
 *      -RESET:  DAT line inactive
 *       @arg : SDIO_FLAG_CMD_DAT_INHIBIT:
 *      -SET: Can not issue command which uses the DAT line
 *      -RESET: Can issue command which uses the DAT line
 *     @arg : SDIO_FLAG_CMD_INHIBIT
 *      -SET: Can not issue command
 *      -RESET: Can issue command using only CMD line
 * @retval The new state of SDIO_FLAG (SET or RESET).
 */
FlagStatus SDIO_GetFlagStatus(uint32_t SDIO_FLAG)
{
    FlagStatus bitstatus = RESET;

    /* Check the parameters */
    assert_param(IS_SDIO_FLAG(SDIO_FLAG));

    if ((SDIO->PRESENT_STATE & SDIO_FLAG) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return bitstatus;
}

/**
  * @brief  Clears the SDIO interrupt pending bits.
  * @param  SDIO_INT: specifies the interrupt pending bit to clear.
  *   This parameter can be any combination of the following values:
  *     @arg SDIO_INT_ERROR:
  *     @arg SDIO_INT_CARD:
  *     @arg SDIO_INT_DMA:
  *     @arg SDIO_INT_TF_CMPL:
  *     @arg SDIO_INT_CMD_CMPL:Clear command complete interrupt.
  * @retval None
  */
void SDIO_ClearINTPendingBit(uint32_t SDIO_INT)
{
    /* Check the parameters */
    assert_param(IS_SDIO_INT(SDIO_INT));

    /* Clear the selected SDIO interrupt */
    SDIO->NORMAL_INTR_SR = SDIO_INT;
}

/**
  * @brief  Clears the SDIO error interrupt pending bits.
  * @param SDIO_INT: specifies the error interrupt pending bit to clear.
  *   This parameter can be any combination of the following values:
  *     @arg SDIO_INT_VENDOR_SPECIFIC_ERR:
  *     @arg SDIO_INT_ADMA_ERR:
  *     @arg SDIO_INT_AUTO_CMD12_ERR:
  *   @arg SDIO_INT_CURRENT_LIMIT_ERR:
  *   @arg SDIO_INT_DAT_END_BIT_ERR:
  *   @arg SDIO_INT_DAT_CRC_ERR:
  *   @arg SDIO_INT_DAT_TIMEOUT_ERR:
  *   @arg SDIO_INT_CMD_INDEX_ERR:
  *   @arg SDIO_INT_CMD_END_BIT_ERR:
  *   @arg SDIO_INT_CMD_CRC_ERR:
  *   @arg SDIO_INT_CMD_TIMEOUT_ERR:
  * @retval None
  */
void SDIO_ClearErrorINTPendingBit(uint32_t SDIO_INT)
{
    /* Check the parameters */
    assert_param(IS_SDIO_INT(SDIO_INT));

    /* Clear the selected SDIO interrupt */
    SDIO->ERR_INTR_SR = SDIO_INT;
}

/**
 * @brief  Returns response received from the card for the last command.
 * @param  SDIO_RESP: Specifies the SDIO response register.
 *   This parameter can be one of the following values:
 *       @arg SDIO_RSP0: Response Register 0~1
 *       @arg SDIO_RSP2: Response Register 2~3
 *       @arg SDIO_RSP4: Response Register 4~5
 *       @arg SDIO_RSP6: Response Register 6~7
 * @retval value of SDIO_RESP.
 */
uint32_t SDIO_GetResponse(uint32_t SDIO_RSP)
{
    /* Check the parameters */
    assert_param(IS_SDIO_RESP(SDIO_RSP));

    return *((volatile uint32_t *)((uint32_t)(&(SDIO->RSP0)) + SDIO_RSP));
}

/******************* (C) COPYRIGHT 2016 Realtek Semiconductor Corporation *****END OF FILE****/

